# Class 1_Intro. to Pandas, Data source (Type)

In [84]:
import numpy as np

import pandas as pd

In [14]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [13]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [85]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

df

                   A         B         C         D
2013-01-01  0.379446  0.514865 -0.224455  1.548727
2013-01-02  0.834003 -1.235718 -1.296307 -0.499268
2013-01-03 -0.723247 -0.003532 -0.909959 -0.881660
2013-01-04  0.960630 -0.215885 -0.595890 -0.443129
2013-01-05 -1.095526 -0.696056 -0.961592 -1.782136
2013-01-06  0.421009  0.185470  0.042294 -2.068082

In [16]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [17]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [22]:
df.head()

                   A         B         C         D
2013-01-01 -0.246082  0.217064  0.505451  0.879576
2013-01-02  0.297989 -0.297863 -0.397793  1.124965
2013-01-03  0.160193  1.607096 -0.431146  0.382648
2013-01-04  0.277637 -0.722488 -0.379187 -1.138039
2013-01-05  0.167766 -0.058249  2.388169  0.118801

In [23]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.277637 -0.722488 -0.379187 -1.138039
2013-01-05  0.167766 -0.058249  2.388169  0.118801
2013-01-06 -0.508289 -1.556415  0.571614  1.396049

In [24]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [25]:
df.to_numpy()

array([[-0.24608236,  0.21706361,  0.50545077,  0.87957616],
       [ 0.29798889, -0.29786266, -0.39779257,  1.12496518],
       [ 0.16019302,  1.60709635, -0.43114638,  0.38264769],
       [ 0.27763692, -0.72248751, -0.3791869 , -1.13803923],
       [ 0.16776635, -0.05824859,  2.38816882,  0.11880098],
       [-0.50828863, -1.55641543,  0.57161412,  1.39604905]])

In [26]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.024869 -0.135142  0.376185  0.460667
std    0.327075  1.054213  1.088521  0.913295
min   -0.508289 -1.556415 -0.431146 -1.138039
25%   -0.144514 -0.616331 -0.393141  0.184763
50%    0.163980 -0.178056  0.063132  0.631112
75%    0.250169  0.148236  0.555073  1.063618
max    0.297989  1.607096  2.388169  1.396049

In [27]:
df2.describe()

         A                    B    C    D
count  4.0                    4  4.0  4.0
mean   1.0  2013-01-02 00:00:00  1.0  3.0
min    1.0  2013-01-02 00:00:00  1.0  3.0
25%    1.0  2013-01-02 00:00:00  1.0  3.0
50%    1.0  2013-01-02 00:00:00  1.0  3.0
75%    1.0  2013-01-02 00:00:00  1.0  3.0
max    1.0  2013-01-02 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0

In [28]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.246082    0.297989    0.160193    0.277637    0.167766   -0.508289
B    0.217064   -0.297863    1.607096   -0.722488   -0.058249   -1.556415
C    0.505451   -0.397793   -0.431146   -0.379187    2.388169    0.571614
D    0.879576    1.124965    0.382648   -1.138039    0.118801    1.396049

In [29]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.879576  0.505451  0.217064 -0.246082
2013-01-02  1.124965 -0.397793 -0.297863  0.297989
2013-01-03  0.382648 -0.431146  1.607096  0.160193
2013-01-04 -1.138039 -0.379187 -0.722488  0.277637
2013-01-05  0.118801  2.388169 -0.058249  0.167766
2013-01-06  1.396049  0.571614 -1.556415 -0.508289

In [30]:
df.sort_index(ascending=False)

                   A         B         C         D
2013-01-06 -0.508289 -1.556415  0.571614  1.396049
2013-01-05  0.167766 -0.058249  2.388169  0.118801
2013-01-04  0.277637 -0.722488 -0.379187 -1.138039
2013-01-03  0.160193  1.607096 -0.431146  0.382648
2013-01-02  0.297989 -0.297863 -0.397793  1.124965
2013-01-01 -0.246082  0.217064  0.505451  0.879576

In [31]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06 -0.508289 -1.556415  0.571614  1.396049
2013-01-04  0.277637 -0.722488 -0.379187 -1.138039
2013-01-02  0.297989 -0.297863 -0.397793  1.124965
2013-01-05  0.167766 -0.058249  2.388169  0.118801
2013-01-01 -0.246082  0.217064  0.505451  0.879576
2013-01-03  0.160193  1.607096 -0.431146  0.382648

In [44]:
df["A"]

2013-01-01   -0.246082
2013-01-02    0.297989
2013-01-03    0.160193
2013-01-04    0.277637
2013-01-05    0.167766
2013-01-06   -0.508289
Freq: D, Name: A, dtype: float64

In [35]:
df.A

2013-01-01   -0.246082
2013-01-02    0.297989
2013-01-03    0.160193
2013-01-04    0.277637
2013-01-05    0.167766
2013-01-06   -0.508289
Freq: D, Name: A, dtype: float64

In [36]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.246082  0.217064  0.505451  0.879576
2013-01-02  0.297989 -0.297863 -0.397793  1.124965
2013-01-03  0.160193  1.607096 -0.431146  0.382648

In [37]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.297989 -0.297863 -0.397793  1.124965
2013-01-03  0.160193  1.607096 -0.431146  0.382648
2013-01-04  0.277637 -0.722488 -0.379187 -1.138039

In [46]:
df = pd.DataFrame(np.random.randint(0, 5, (10, 5)))

df.to_csv("foo.csv")

In [48]:
pd.read_csv("foo.csv")

   Unnamed: 0  0  1  2  3  4
0           0  1  0  0  0  1
1           1  0  3  2  1  3
2           2  1  4  3  0  1
3           3  1  4  3  4  2
4           4  4  1  1  3  4
5           5  4  0  3  3  1
6           6  1  1  1  2  3
7           7  1  1  3  2  0
8           8  4  0  1  0  0
9           9  1  2  3  4  0

In [86]:
df

                   A         B         C         D
2013-01-01  0.379446  0.514865 -0.224455  1.548727
2013-01-02  0.834003 -1.235718 -1.296307 -0.499268
2013-01-03 -0.723247 -0.003532 -0.909959 -0.881660
2013-01-04  0.960630 -0.215885 -0.595890 -0.443129
2013-01-05 -1.095526 -0.696056 -0.961592 -1.782136
2013-01-06  0.421009  0.185470  0.042294 -2.068082

In [87]:
df.loc[dates[0]]

A    0.379446
B    0.514865
C   -0.224455
D    1.548727
Name: 2013-01-01 00:00:00, dtype: float64

In [88]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.379446  0.514865
2013-01-02  0.834003 -1.235718
2013-01-03 -0.723247 -0.003532
2013-01-04  0.960630 -0.215885
2013-01-05 -1.095526 -0.696056
2013-01-06  0.421009  0.185470

In [89]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.379446  0.514865
2013-01-02  0.834003 -1.235718
2013-01-03 -0.723247 -0.003532
2013-01-04  0.960630 -0.215885
2013-01-05 -1.095526 -0.696056
2013-01-06  0.421009  0.185470

In [90]:
df.loc[dates[0], "A"]

0.3794459076438032

In [91]:
df.at[dates[0], "A"]

0.3794459076438032

In [92]:
df.iloc[3]

A    0.960630
B   -0.215885
C   -0.595890
D   -0.443129
Name: 2013-01-04 00:00:00, dtype: float64

In [93]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.834003 -1.296307
2013-01-03 -0.723247 -0.909959
2013-01-05 -1.095526 -0.961592

In [94]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.834003 -1.235718 -1.296307 -0.499268
2013-01-03 -0.723247 -0.003532 -0.909959 -0.881660

In [95]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.514865 -0.224455
2013-01-02 -1.235718 -1.296307
2013-01-03 -0.003532 -0.909959
2013-01-04 -0.215885 -0.595890
2013-01-05 -0.696056 -0.961592
2013-01-06  0.185470  0.042294

In [96]:
df.iloc[1, 1]

-1.2357183082175651

In [97]:
df.iat[1, 1]

-1.2357183082175651

In [100]:
df

                   A         B         C         D
2013-01-01  0.379446  0.514865 -0.224455  1.548727
2013-01-02  0.834003 -1.235718 -1.296307 -0.499268
2013-01-03 -0.723247 -0.003532 -0.909959 -0.881660
2013-01-04  0.960630 -0.215885 -0.595890 -0.443129
2013-01-05 -1.095526 -0.696056 -0.961592 -1.782136
2013-01-06  0.421009  0.185470  0.042294 -2.068082

In [98]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.379446  0.514865 -0.224455  1.548727
2013-01-02  0.834003 -1.235718 -1.296307 -0.499268
2013-01-04  0.960630 -0.215885 -0.595890 -0.443129
2013-01-06  0.421009  0.185470  0.042294 -2.068082

In [99]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.379446  0.514865       NaN  1.548727
2013-01-02  0.834003       NaN       NaN       NaN
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04  0.960630       NaN       NaN       NaN
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06  0.421009  0.185470  0.042294       NaN

In [101]:
df2 = df.copy()

In [103]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01  0.379446  0.514865 -0.224455  1.548727    one
2013-01-02  0.834003 -1.235718 -1.296307 -0.499268    one
2013-01-03 -0.723247 -0.003532 -0.909959 -0.881660    two
2013-01-04  0.960630 -0.215885 -0.595890 -0.443129  three
2013-01-05 -1.095526 -0.696056 -0.961592 -1.782136   four
2013-01-06  0.421009  0.185470  0.042294 -2.068082  three

In [106]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -0.723247 -0.003532 -0.909959 -0.881660   two
2013-01-05 -1.095526 -0.696056 -0.961592 -1.782136  four

# Exercise

# Ex1 - Filtering and Sorting Data

Step 1. Import the necessary libraries

In [71]:
import pandas as pd

Step 2. Import the dataset from this URL.
https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv

Step 3. Assign it to a variable called chipo.

In [78]:
import pandas as pd

# Load the dataset from the URL
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv"
chipotle_data = pd.read_csv(url, sep='\t')

# Remove "$" from the "item_price" column and convert it to numeric
chipotle_data['item_price'] = chipotle_data['item_price'].str.replace('$', '').astype(float)

# Display the first few rows of the dataset to verify the changes
chipotle_data

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",8.75

3.1 check dtypes of each column
3.2 print describe
3.3 df.shape

In [79]:
print(chipotle_data.dtypes)
print(chipotle_data.describe())
print(chipotle_data.shape)

order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price            float64
dtype: object
          order_id     quantity   item_price
count  4622.000000  4622.000000  4622.000000
mean    927.254868     1.075725     7.464336
std     528.890796     0.410186     4.245557
min       1.000000     1.000000     1.090000
25%     477.250000     1.000000     3.390000
50%     926.000000     1.000000     8.750000
75%    1393.000000     1.000000     9.250000
max    1834.000000    15.000000    44.250000
(4622, 5)

In [80]:
chipotle_data.isnull().sum()

order_id                 0
quantity                 0
item_name                0
choice_description    1246
item_price               0
dtype: int64

Step 4. Sort by the name of the item

In [81]:
chipotle_data.sort_values(by=["item_name"]).head(10)

      order_id  quantity          item_name choice_description  item_price
3389      1360         2  6 Pack Soft Drink        [Diet Coke]       12.98
341        148         1  6 Pack Soft Drink        [Diet Coke]        6.49
1849       749         1  6 Pack Soft Drink             [Coke]        6.49
1860       754         1  6 Pack Soft Drink        [Diet Coke]        6.49
2713      1076         1  6 Pack Soft Drink             [Coke]        6.49
3422      1373         1  6 Pack Soft Drink             [Coke]        6.49
553        230         1  6 Pack Soft Drink        [Diet Coke]        6.49
1916       774         1  6 Pack Soft Drink        [Diet Coke]        6.49
1922       776         1  6 Pack Soft Drink             [Coke]        6.49
1937       784         1  6 Pack Soft Drink        [Diet Coke]        6.49

In [82]:
chipotle_data.sort_values(by=["item_price"], ascending=False).head(1)

,order_id,quantity,item_name,choice_description,item_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,44.25

Step 6. How many times was a Veggie Salad Bowl ordered?

In [109]:
len(chipotle_data[chipotle_data.item_name == "Veggie Salad Bowl"])

18

Step 7. How many times did someone order more than one Canned Soda?

In [113]:
chipotle_data2 = chipotle_data[chipotle_data.item_name == "Canned Soda"]
len(chipotle_data2[chipotle_data2.quantity > 1])

20

Step 8. How many products cost more than $10.00?

In [116]:
chipotle_data3 = chipotle_data[chipotle_data.item_price > 10]
chipotle_data3.item_name.nunique()

31

Step 9. What is the price of each item?

In [122]:
chipotle_data[(chipotle_data.quantity == 1) & (chipotle_data.item_name == 'Chicken Bowl')]

,order_id,quantity,item_name,choice_description,item_price
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",10.98
13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25
19,10,1,Chicken Bowl,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",8.75
26,13,1,Chicken Bowl,"[Roasted Chili Corn Salsa (Medium), [Pinto Bea...",8.49
42,20,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",11.25
...,...,...,...,...,...
4590,1825,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",11.25
4591,1825,1,Chicken Bowl,"[Tomatillo Red Chili Salsa, [Rice, Black Beans...",8.75
4595,1826,1,Chicken Bowl,"[Tomatillo Green Chili Salsa, [Rice, Black Bea...",8.75
4599,1827,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Cheese, Lettuce]]",8.75
4604,1828,1,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",8.75